In [21]:
import numpy as np
import pandas as pd
from pandas import Series , DataFrame
%matplotlib inline
import matplotlib.pyplot as plt

In [39]:
pd.Series([1,2,3],[4,5,6])# series is 1 dimention

4    1
5    2
6    3
dtype: int64

In [40]:
pd.Series([1,2,3],['a','b','c'])# abc are index AND 123 are values

a    1
b    2
c    3
dtype: int64

In [41]:
a=pd.Series([1,2,3],index=list('abc'))
a

a    1
b    2
c    3
dtype: int64

In [42]:
a.index

Index(['a', 'b', 'c'], dtype='object')

In [43]:
a.values

array([1, 2, 3], dtype=int64)

In [22]:
ww2=Series([870000,440000,300000,210000,40000],index=('ussr','germany','chine','japan','usa'))
ww2

ussr       870000
germany    440000
chine      300000
japan      210000
usa         40000
dtype: int64

In [23]:
ww2['ussr']
ww2[0]

870000

In [46]:
ww2[ww2>100000]

ussr       870000
germany    440000
chine      300000
japan      210000
dtype: int64

In [47]:
'india'in ww2

False

In [48]:
'usa'in ww2

True

In [49]:
ww2dict=ww2.to_dict()# convert into dictionary
ww2dict

{'ussr': 870000,
 'germany': 440000,
 'chine': 300000,
 'japan': 210000,
 'usa': 40000}

In [50]:
ww2dictToSer=Series(ww2dict)# dictionary convert into series
ww2dictToSer

ussr       870000
germany    440000
chine      300000
japan      210000
usa         40000
dtype: int64

In [51]:
countries=['ussr','germany','chine','japan','usa','india']
countries

['ussr', 'germany', 'chine', 'japan', 'usa', 'india']

In [52]:
ser1=Series(ww2dict,index=countries)
ser1

ussr       870000.0
germany    440000.0
chine      300000.0
japan      210000.0
usa         40000.0
india           NaN
dtype: float64

In [53]:
pd.isnull(ser1)# find NULL value in ser1

ussr       False
germany    False
chine      False
japan      False
usa        False
india       True
dtype: bool

In [54]:
pd.notnull(ser1)

ussr        True
germany     True
chine       True
japan       True
usa         True
india      False
dtype: bool

In [55]:
pd.isnull(ser1).sum()# how many NULL value

1

In [56]:
pd.isnull(ser1).count()# count NULL value alse

6

In [57]:
pd.notnull(ser1).sum()# only value will count

5

In [58]:
ser1['india']=223
ser1

ussr       870000.0
germany    440000.0
chine      300000.0
japan      210000.0
usa         40000.0
india         223.0
dtype: float64

In [59]:
ser1[5]=55555
ser1

ussr       870000.0
germany    440000.0
chine      300000.0
japan      210000.0
usa         40000.0
india       55555.0
dtype: float64

In [60]:
ww2dictToSer+ser1# india values is NULL bz of (NULL+5555=NULL)

chine       600000.0
germany     880000.0
india            NaN
japan       420000.0
usa          80000.0
ussr       1740000.0
dtype: float64

In [61]:
'india' in ser1

True

In [62]:
ser1

ussr       870000.0
germany    440000.0
chine      300000.0
japan      210000.0
usa         40000.0
india       55555.0
dtype: float64

In [63]:
ww2dictToSer

ussr       870000
germany    440000
chine      300000
japan      210000
usa         40000
dtype: int64

In [64]:
ww2.name='world war2 casualties'
ww2.name

'world war2 casualties'

In [65]:
ww2.index.name='casualties'
ww2

casualties
ussr       870000
germany    440000
chine      300000
japan      210000
usa         40000
Name: world war2 casualties, dtype: int64

In [66]:
ww2.index.name=''

# DATA FRAME

In [1]:
# df is 2 dimention labels data structure with 
#you can think of its like pltae shit or dictionary of series of object its generaly commaly used pandas

In [4]:
df1=DataFrame({'countries':['LA','SP','NY'],'population':[100,200,300]})
df1

  countries  population
0        LA         100
1        SP         200
2        NY         300

In [5]:
df2=DataFrame({'countries':['LA','SP','NY'],'population':[100,200,300]},index=['A','B','C'])
df2

  countries  population
A        LA         100
B        SP         200
C        NY         300

In [7]:
df3=DataFrame(np.arange(1,10).reshape([3,3]),columns=['C1','C2','C3'],index=['A','B','C'])
df3

   C1  C2  C3
A   1   2   3
B   4   5   6
C   7   8   9

In [25]:
data=[{'a':1,'b':2},{'a':3,'b':5,'c':25}]
df4= DataFrame(data,index=['alpha','beta'])
df4

       a  b     c
alpha  1  2   NaN
beta   3  5  25.0

In [13]:
nfldf=pd.read_clipboard()# randomly copy from internet 
nfldf                    # list of all time nfl win loss records

,Rank,Team,GP,Won,Lost,Tied,Pct.,First NFL Season,Division
0,1,Dallas Cowboys,898,512,380,6,0.573,1960,NFC East
1,2,Chicago Bears,"1,386",761,583,42,0.564,1920,NFC North
2,3,Green Bay Packers,"1,352",743,571,38,0.564,1921,NFC North
3,4,New England Patriots[b],900,500,391,9,0.561,1960,AFC East
4,5,Miami Dolphins,816,452,360,4,0.556,1966,AFC East
5,6,Minnesota Vikings,886,478,397,11,0.546,1961,NFC North
6,7,Baltimore Ravens,368,200,167,1,0.545,1996,AFC North
7,8,New York Giants,"1,321",692,596,33,0.536,1925,NFC East
8,9,Denver Broncos,900,476,414,10,0.534,1960,AFC West
9,10,San Francisco 49ers,"1,018",532,472,14,0.529,1950,NFC West
10,11,Indianapolis Colts[c],982,516,459,7,0.529,1953,AFC South
11,12,Pittsburgh Steelers,"1,208",628,558,22,0.529,1933,AFC North
12,13,Kansas City Chiefs,900,469,419,12,0.528,1960,AFC West
13,14,Oakland Raiders,900,466,423,11,0.524,1960,AFC West
14,15,Seattle Seahawks,676,344,331,1,0.510,1976,NFC West
15,16,Washington Redskins,"1,220",602,590,28,0.505,1932,NFC East
16,17,Los Angeles Chargers[d],900,447,442,11,0.503,1960,AFC West
17,18,Los Angeles Rams,"1,151",568,562,21,0.503,1937,NFC West
18,19,Carolina Panthers,384,190,193,1,0.496,1995,NFC South
19,20,Philadelphia Eagles,"1,204",577,601,26,0.490,1933,NFC East
20,21,Cleveland Browns,970,469,490,11,0.489,1950,AFC North
21,22,Tennessee Titans,900,431,463,6,0.482,1960,AFC South
22,23,Buffalo Bills,900,415,477,8,0.466,1960,AFC East
23,24,Detroit Lions,"1,249",559,658,32,0.460,1930,NFC North
24,25,Cincinnati Bengals,788,357,427,4,0.456,1968,AFC North
25,26,New Orleans Saints,802,362,435,5,0.454,1967,NFC South
26,27,New York Jets,900,401,491,8,0.450,1960,AFC East
27,28,Houston Texans,272,121,151,0,0.445,2002,AFC South
28,29,Jacksonville Jaguars,384,170,214,0,0.443,1995,AFC South
29,30,Atlanta Falcons,816,358,452,6,0.442,1966,NFC South
30,31,Arizona Cardinals,"1,346",553,753,40,0.426,1920,NFC West
31,32,Tampa Bay Buccaneers,676,260,415,1,0.385,1976,NFC South

In [14]:
nfldf.columns

Index(['Rank', 'Team', 'GP', 'Won', 'Lost', 'Tied', 'Pct.', 'First NFL Season',
       'Division'],
      dtype='object')

In [15]:
nflnewdf=DataFrame(nfldf,columns=['Team','Won','Lost'])
nflnewdf

                       Team  Won  Lost
0            Dallas Cowboys  512   380
1             Chicago Bears  761   583
2         Green Bay Packers  743   571
3   New England Patriots[b]  500   391
4            Miami Dolphins  452   360
5         Minnesota Vikings  478   397
6          Baltimore Ravens  200   167
7           New York Giants  692   596
8            Denver Broncos  476   414
9       San Francisco 49ers  532   472
10    Indianapolis Colts[c]  516   459
11      Pittsburgh Steelers  628   558
12       Kansas City Chiefs  469   419
13          Oakland Raiders  466   423
14         Seattle Seahawks  344   331
15      Washington Redskins  602   590
16  Los Angeles Chargers[d]  447   442
17         Los Angeles Rams  568   562
18        Carolina Panthers  190   193
19      Philadelphia Eagles  577   601
20         Cleveland Browns  469   490
21         Tennessee Titans  431   463
22            Buffalo Bills  415   477
23            Detroit Lions  559   658
24       Cincinnati Bengals  357   427
25       New Orleans Saints  362   435
26            New York Jets  401   491
27           Houston Texans  121   151
28     Jacksonville Jaguars  170   214
29          Atlanta Falcons  358   452
30        Arizona Cardinals  553   753
31     Tampa Bay Buccaneers  260   415

In [16]:
nflnewdf=DataFrame(nfldf,columns=['Team','Won','Lost','Stadium'])
nflnewdf

                       Team  Won  Lost  Stadium
0            Dallas Cowboys  512   380      NaN
1             Chicago Bears  761   583      NaN
2         Green Bay Packers  743   571      NaN
3   New England Patriots[b]  500   391      NaN
4            Miami Dolphins  452   360      NaN
5         Minnesota Vikings  478   397      NaN
6          Baltimore Ravens  200   167      NaN
7           New York Giants  692   596      NaN
8            Denver Broncos  476   414      NaN
9       San Francisco 49ers  532   472      NaN
10    Indianapolis Colts[c]  516   459      NaN
11      Pittsburgh Steelers  628   558      NaN
12       Kansas City Chiefs  469   419      NaN
13          Oakland Raiders  466   423      NaN
14         Seattle Seahawks  344   331      NaN
15      Washington Redskins  602   590      NaN
16  Los Angeles Chargers[d]  447   442      NaN
17         Los Angeles Rams  568   562      NaN
18        Carolina Panthers  190   193      NaN
19      Philadelphia Eagles  577   601      NaN
20         Cleveland Browns  469   490      NaN
21         Tennessee Titans  431   463      NaN
22            Buffalo Bills  415   477      NaN
23            Detroit Lions  559   658      NaN
24       Cincinnati Bengals  357   427      NaN
25       New Orleans Saints  362   435      NaN
26            New York Jets  401   491      NaN
27           Houston Texans  121   151      NaN
28     Jacksonville Jaguars  170   214      NaN
29          Atlanta Falcons  358   452      NaN
30        Arizona Cardinals  553   753      NaN
31     Tampa Bay Buccaneers  260   415      NaN

In [18]:
nflnewdf['Stadium']='JAMTHA'
nflnewdf

                       Team  Won  Lost Stadium
0            Dallas Cowboys  512   380  JAMTHA
1             Chicago Bears  761   583  JAMTHA
2         Green Bay Packers  743   571  JAMTHA
3   New England Patriots[b]  500   391  JAMTHA
4            Miami Dolphins  452   360  JAMTHA
5         Minnesota Vikings  478   397  JAMTHA
6          Baltimore Ravens  200   167  JAMTHA
7           New York Giants  692   596  JAMTHA
8            Denver Broncos  476   414  JAMTHA
9       San Francisco 49ers  532   472  JAMTHA
10    Indianapolis Colts[c]  516   459  JAMTHA
11      Pittsburgh Steelers  628   558  JAMTHA
12       Kansas City Chiefs  469   419  JAMTHA
13          Oakland Raiders  466   423  JAMTHA
14         Seattle Seahawks  344   331  JAMTHA
15      Washington Redskins  602   590  JAMTHA
16  Los Angeles Chargers[d]  447   442  JAMTHA
17         Los Angeles Rams  568   562  JAMTHA
18        Carolina Panthers  190   193  JAMTHA
19      Philadelphia Eagles  577   601  JAMTHA
20         Cleveland Browns  469   490  JAMTHA
21         Tennessee Titans  431   463  JAMTHA
22            Buffalo Bills  415   477  JAMTHA
23            Detroit Lions  559   658  JAMTHA
24       Cincinnati Bengals  357   427  JAMTHA
25       New Orleans Saints  362   435  JAMTHA
26            New York Jets  401   491  JAMTHA
27           Houston Texans  121   151  JAMTHA
28     Jacksonville Jaguars  170   214  JAMTHA
29          Atlanta Falcons  358   452  JAMTHA
30        Arizona Cardinals  553   753  JAMTHA
31     Tampa Bay Buccaneers  260   415  JAMTHA

In [27]:
nflnewdf['Stadium']=np.arange(1,33)
nflnewdf

                       Team  Won  Lost  Stadium
0            Dallas Cowboys  512   380        1
1             Chicago Bears  761   583        2
2         Green Bay Packers  743   571        3
3   New England Patriots[b]  500   391        4
4            Miami Dolphins  452   360        5
5         Minnesota Vikings  478   397        6
6          Baltimore Ravens  200   167        7
7           New York Giants  692   596        8
8            Denver Broncos  476   414        9
9       San Francisco 49ers  532   472       10
10    Indianapolis Colts[c]  516   459       11
11      Pittsburgh Steelers  628   558       12
12       Kansas City Chiefs  469   419       13
13          Oakland Raiders  466   423       14
14         Seattle Seahawks  344   331       15
15      Washington Redskins  602   590       16
16  Los Angeles Chargers[d]  447   442       17
17         Los Angeles Rams  568   562       18
18        Carolina Panthers  190   193       19
19      Philadelphia Eagles  577   601       20
20         Cleveland Browns  469   490       21
21         Tennessee Titans  431   463       22
22            Buffalo Bills  415   477       23
23            Detroit Lions  559   658       24
24       Cincinnati Bengals  357   427       25
25       New Orleans Saints  362   435       26
26            New York Jets  401   491       27
27           Houston Texans  121   151       28
28     Jacksonville Jaguars  170   214       29
29          Atlanta Falcons  358   452       30
30        Arizona Cardinals  553   753       31
31     Tampa Bay Buccaneers  260   415       32

In [79]:
stadium=pd.Series(['VCA','JAMATHA','WANKHEDE'],[1,3,4])
stadium 


stadium.index.name='STADIUM'
stadium

STADIUM
1         VCA
3     JAMATHA
4    WANKHEDE
dtype: object

In [76]:
nflnewdf['Stadium']=stadium
nflnewdf

                       Team  Won  Lost   Stadium
0            Dallas Cowboys  512   380       NaN
1             Chicago Bears  761   583       VCA
2         Green Bay Packers  743   571       NaN
3   New England Patriots[b]  500   391   JAMATHA
4            Miami Dolphins  452   360  WANKHEDE
5         Minnesota Vikings  478   397       NaN
6          Baltimore Ravens  200   167       NaN
7           New York Giants  692   596       NaN
8            Denver Broncos  476   414       NaN
9       San Francisco 49ers  532   472       NaN
10    Indianapolis Colts[c]  516   459       NaN
11      Pittsburgh Steelers  628   558       NaN
12       Kansas City Chiefs  469   419       NaN
13          Oakland Raiders  466   423       NaN
14         Seattle Seahawks  344   331       NaN
15      Washington Redskins  602   590       NaN
16  Los Angeles Chargers[d]  447   442       NaN
17         Los Angeles Rams  568   562       NaN
18        Carolina Panthers  190   193       NaN
19      Philadelphia Eagles  577   601       NaN
20         Cleveland Browns  469   490       NaN
21         Tennessee Titans  431   463       NaN
22            Buffalo Bills  415   477       NaN
23            Detroit Lions  559   658       NaN
24       Cincinnati Bengals  357   427       NaN
25       New Orleans Saints  362   435       NaN
26            New York Jets  401   491       NaN
27           Houston Texans  121   151       NaN
28     Jacksonville Jaguars  170   214       NaN
29          Atlanta Falcons  358   452       NaN
30        Arizona Cardinals  553   753       NaN
31     Tampa Bay Buccaneers  260   415       NaN

# RE-INDEXING    reindex([new_indexlist],fill_value=,method=)

In [25]:
abc=pd.Series([0,1,2,3],['A','B','C','D'])
abc

A    True
B    True
C    True
D    True
dtype: bool

In [21]:
abc.reindex(['A','B','C','D','E'])

A    0.0
B    1.0
C    2.0
D    3.0
E    NaN
dtype: float64

In [27]:
abc.reindex(['A','B','C','D','E','F','G'],fill_value=np.nanmean(abc))
abc.reindex(['A','B','C','D','E','F','G'],fill_value=100)

A    0.0
B    1.0
C    2.0
D    3.0
E    1.5
F    1.5
G    1.5
dtype: float64

In [9]:
a=pd.Series(['USA','IND','PAK'],[0,3,7])
a

0    USA
3    IND
7    PAK
dtype: object

In [10]:
a.reindex(range(11),method='ffill')# forwrd fill

0     USA
1     USA
2     USA
3     IND
4     IND
5     IND
6     IND
7     PAK
8     PAK
9     PAK
10    PAK
dtype: object

In [11]:
a.reindex(range(11),method='bfill')# backword fill

0     USA
1     IND
2     IND
3     IND
4     PAK
5     PAK
6     PAK
7     PAK
8     NaN
9     NaN
10    NaN
dtype: object

In [23]:
df=DataFrame(np.arange(1,17).reshape([4,4]),index=['A','B','C','D'],columns=['C1','C2','C3','C4'])
df

   C1  C2  C3  C4
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [24]:
df=DataFrame(np.random.randint(1,100,size=[4,4]),index=['A','B','C','D'],columns=['C1','C2','C3','C4'])
df# for RANDOM NUMBERS or

   C1  C2  C3  C4
A  13  81  83   1
B  77  93  83  85
C  77  63  28  13
D  25  49  47  35

In [7]:
df=DataFrame(np.random.randn(16).reshape([4,4]),index=['A','B','C','D'],columns=['C1','C2','C3','C4'])
df

         C1        C2        C3        C4
A -1.440361 -0.031383 -1.054746 -0.291772
B  0.653515  0.112411 -0.280670 -0.324739
C -0.842360  0.081630 -0.499980 -1.817030
D  0.622902  0.350763 -0.143594 -0.619791

In [9]:
df=df.reindex(['A','B','C','D','E'])
df

         C1        C2        C3        C4
A -1.440361 -0.031383 -1.054746 -0.291772
B  0.653515  0.112411 -0.280670 -0.324739
C -0.842360  0.081630 -0.499980 -1.817030
D  0.622902  0.350763 -0.143594 -0.619791
E       NaN       NaN       NaN       NaN

In [36]:
newColumns=(['C1','C2','C3','C4','C5'])
df

         C1        C2        C3        C4
A  0.360399 -1.477128 -1.035584  0.858721
B  0.012789  1.630945 -1.713135 -0.667567
C  0.848235 -0.081122  0.077452  0.413141
D  0.008673 -1.496817  0.853249  0.463631
E       NaN       NaN       NaN       NaN

In [39]:
df=df.reindex(Columns=newColumns)
df

TypeError: reindex() got an unexpected keyword argument "Columns"

In [40]:
df.drop('E')# DELETE the ROWS

         C1        C2        C3        C4
A  0.360399 -1.477128 -1.035584  0.858721
B  0.012789  1.630945 -1.713135 -0.667567
C  0.848235 -0.081122  0.077452  0.413141
D  0.008673 -1.496817  0.853249  0.463631

In [41]:
df.drop('C4',axis=1)# DELETE the COLUMNS

         C1        C2        C3
A  0.360399 -1.477128 -1.035584
B  0.012789  1.630945 -1.713135
C  0.848235 -0.081122  0.077452
D  0.008673 -1.496817  0.853249
E       NaN       NaN       NaN

In [45]:
a=pd.Series([1,2,3],index=['A','B','C'])
a

A    1
B    2
C    3
dtype: int64

In [46]:
abc[abc>2]

D    3
dtype: int64

In [10]:
df=DataFrame(np.arange(0,25).reshape([5,5]),index=['KKR','CSK','MI','RCB','DD'],columns=['A','B','C','D','E'])
df

      A   B   C   D   E
KKR   0   1   2   3   4
CSK   5   6   7   8   9
MI   10  11  12  13  14
RCB  15  16  17  18  19
DD   20  21  22  23  24

In [6]:
df['A']# to select the columns

KKR     0
CSK     5
MI     10
RCB    15
DD     20
Name: A, dtype: int32

In [13]:
# df[:'KKR']# to select the ROW. Below all are same
df[:'MI']
df[0:3]
df[:3]

      A   B   C   D   E
KKR   0   1   2   3   4
CSK   5   6   7   8   9
MI   10  11  12  13  14

In [64]:
df[['A','C']]# to select the 'A' AND 'C' COLUMNS

      A   C
KKR   0   2
CSK   5   7
MI   10  12
RCB  15  17
DD   20  22

In [66]:
df[df>8]# its not perfect bz its not random values

        A     B     C     D     E
KKR   NaN   NaN   NaN   NaN   NaN
CSK   NaN   NaN   NaN   NaN   9.0
MI   10.0  11.0  12.0  13.0  14.0
RCB  15.0  16.0  17.0  18.0  19.0
DD   20.0  21.0  22.0  23.0  24.0

In [70]:
df[df['C']>8]# ITS PERFECT

      A   B   C   D   E
MI   10  11  12  13  14
RCB  15  16  17  18  19
DD   20  21  22  23  24

In [84]:
df[:'KKR']

     A  B  C  D  E
KKR  0  1  2  3  4

In [91]:
df.iloc[0]# peak ROW,only index allowed

A    0
B    1
C    2
D    3
E    4
Name: KKR, dtype: int32

In [98]:
df.loc['KKR']# pick ROW ,only string allowed

A    0
B    1
C    2
D    3
E    4
Name: KKR, dtype: int32

In [100]:
ser1=pd.Series([1,2,3],['A','B','C'])
ser1

A    1
B    2
C    3
dtype: int64

In [101]:
ser2=pd.Series([1,2,3,4,5],['A','B','C','D','E'])
ser2

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [106]:
ser1+ser2

A    2.0
B    4.0
C    6.0
D    NaN
E    NaN
dtype: float64

In [116]:
ser1.add(ser2,fill_value=0)

A    2.0
B    4.0
C    6.0
D    4.0
E    5.0
dtype: float64

# DATA ALIGNMENT

In [60]:
df1=DataFrame(np.arange(0,4).reshape([2,2]),index=['MI','CSK'],columns=['A','B'])
df1

     A  B
MI   0  1
CSK  2  3

In [61]:
df2=DataFrame(np.arange(0,9).reshape([3,3]),columns=['A','C','D'],index=['MI','CSK','KKR'])
df2

     A  C  D
MI   0  1  2
CSK  3  4  5
KKR  6  7  8

In [62]:
df1.add(df2)# both are same df1+df2

       A   B   C   D
CSK  5.0 NaN NaN NaN
KKR  NaN NaN NaN NaN
MI   0.0 NaN NaN NaN

In [63]:
df1+df2

       A   B   C   D
CSK  5.0 NaN NaN NaN
KKR  NaN NaN NaN NaN
MI   0.0 NaN NaN NaN

In [64]:
df1.add(df2,fill_value=0)

       A    B    C    D
CSK  5.0  3.0  4.0  5.0
KKR  6.0  NaN  7.0  8.0
MI   0.0  1.0  1.0  2.0

In [65]:
df3=df1.add(df2,fill_value=0)
df3

       A    B    C    D
CSK  5.0  3.0  4.0  5.0
KKR  6.0  NaN  7.0  8.0
MI   0.0  1.0  1.0  2.0

In [66]:
df3['B']['KKR']=10 # to fill the Values in data frame
df3# columns then ROW

       A     B    C    D
CSK  5.0   3.0  4.0  5.0
KKR  6.0  10.0  7.0  8.0
MI   0.0   1.0  1.0  2.0

In [67]:
df3.iloc[1,2]=24 # 'i'=index but 1=row, 2=columns 
df3

       A     B     C    D
CSK  5.0   3.0   4.0  5.0
KKR  6.0  10.0  24.0  8.0
MI   0.0   1.0   1.0  2.0

In [69]:
df3.loc['KKR','B']=28# row and columns
df3

       A     B     C    D
CSK  5.0   3.0   4.0  5.0
KKR  6.0  28.0  24.0  8.0
MI   0.0   1.0   1.0  2.0

In [2]:
ser4=pd.Series([0,1,2],['C','A','B'])

ser4

C    0
A    1
B    2
dtype: int64

In [3]:
ser4.sort_index()# for index sorting

A    1
B    2
C    0
dtype: int64

In [5]:
ser4.sort_values()

C    0
A    1
B    2
dtype: int64

In [8]:
ser5=Series(np.random.randn(4))
ser5

0    0.079046
1    1.187578
2   -0.021260
3    1.179214
dtype: float64

In [9]:
ser5.rank()# find the rank of series

0    2.0
1    4.0
2    1.0
3    3.0
dtype: float64

In [12]:
y=ser5.sort_values()# SORTing of the values
y

2   -0.021260
0    0.079046
3    1.179214
1    1.187578
dtype: float64

In [13]:
y.rank()# right side is rank

2    1.0
0    2.0
3    3.0
1    4.0
dtype: float64

# missing value

In [6]:
a=Series(['one','two',np.nan,'four',np.nan])
a

0     one
1     two
2     NaN
3    four
4     NaN
dtype: object

In [14]:
a.isnull()

0    False
1    False
2     True
3    False
4     True
dtype: bool

In [15]:
a.notnull()

0     True
1     True
2    False
3     True
4    False
dtype: bool

In [16]:
a.isnull().sum()# how many nulll values in series will count or sum

2

In [18]:
a.dropna()# how many values in series not accept the null values

0     one
1     two
3    four
dtype: object

In [3]:
df6=DataFrame([[0,1,2],[3,np.nan,5],[np.nan,7,8],[np.nan,np.nan,np.nan]])# to enter NULL values in DATA FRAME
df6

     0    1    2
0  0.0  1.0  2.0
1  3.0  NaN  5.0
2  NaN  7.0  8.0
3  NaN  NaN  NaN

In [4]:
df6.dropna()# only select the non null value OR select digit value

     0    1    2
0  0.0  1.0  2.0

In [5]:
df6.dropna(how='all')# select full null series i.e 3

     0    1    2
0  0.0  1.0  2.0
1  3.0  NaN  5.0
2  NaN  7.0  8.0

In [6]:
df6.dropna(axis=1)# all columns having nulll values

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [111]:
df6# its not implimented bz its not selected in any veriale i.e

     0    1    2
0  0.0  1.0  2.0
1  3.0  NaN  5.0
2  NaN  7.0  8.0
3  NaN  NaN  NaN

In [40]:
df6=DataFrame([[1,2,3,np.nan,55],[2,np.nan,5,6,np.nan],[np.nan,7,np.nan,9,np.nan],[1,np.nan,np.nan,np.nan]],dtype=int)# to enter NULL values in DATA FRAME
df6

     0    1    2    3     4
0  1.0  2.0  3.0  NaN  55.0
1  2.0  NaN  5.0  6.0   NaN
2  NaN  7.0  NaN  9.0   NaN
3  1.0  NaN  NaN  NaN   NaN

In [41]:
df6.dropna(thresh=2)

     0    1    2    3     4
0  1.0  2.0  3.0  NaN  55.0
1  2.0  NaN  5.0  6.0   NaN
2  NaN  7.0  NaN  9.0   NaN

In [42]:
df6.dropna(thresh=3)# 3 values will kept

     0    1    2    3     4
0  1.0  2.0  3.0  NaN  55.0
1  2.0  NaN  5.0  6.0   NaN

In [47]:
df6.dropna(subset=[1])#column 1 = drop null values

     0    1    2    3     4
0  1.0  2.0  3.0  NaN  55.0
2  NaN  7.0  NaN  9.0   NaN

In [8]:
df6.fillna(1)

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [21]:
df6=DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan]],dtype=int)
df6

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [46]:
df6

     0    1    2    3     4
0  1.0  2.0  3.0  NaN  55.0
1  2.0  NaN  5.0  6.0   NaN
2  NaN  7.0  NaN  9.0   NaN
3  1.0  NaN  NaN  NaN   NaN

In [35]:
df6=df6.fillna({0:0,1:1,2:8,3:10})
df6

     0    1    2     3     4
0  1.0  2.0  3.0  10.0  55.0
1  2.0  1.0  5.0   6.0   NaN
2  0.0  7.0  8.0   9.0   NaN
3  1.0  1.0  8.0  10.0   NaN

In [23]:
df6=df.fillna(0,inplace=True)
df6

# INDEX Hierarchy

In [26]:
serl=Series(np.random.randn(6),index=[[1,1,1,2,2,2],['A','B','C','A','B','C']])
serl

1  A    0.329762
   B   -0.525728
   C    0.788755
2  A    1.038792
   B   -0.711490
   C   -0.285284
dtype: float64

In [27]:
serl[1]

A    0.329762
B   -0.525728
C    0.788755
dtype: float64

In [28]:
serl[1,'A']

0.32976154915673495

In [29]:
serl[1]['A']

0.32976154915673495

In [30]:
serl[:,'A']# 1,2 = A ke pure columns kept

1    0.329762
2    1.038792
dtype: float64

In [31]:
serl.index

MultiIndex(levels=[[1, 2], ['A', 'B', 'C']],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [33]:
a=serl.unstack()# series convert into Data frame
a

          A         B         C
1  0.329762 -0.525728  0.788755
2  1.038792 -0.711490 -0.285284

In [38]:
a.unstack()# data frame convert into series

A  1    0.329762
   2    1.038792
B  1   -0.525728
   2   -0.711490
C  1    0.788755
   2   -0.285284
dtype: float64

In [21]:
a=DataFrame(np.arange(16).reshape([4,4]),index=[['a','a','b','b'],[1,2,1,2]],columns=[['nagpur','nagpur','pune','mumbai'],['cold','hot','hot','cold']])
a

    nagpur     pune mumbai
      cold hot  hot   cold
a 1      0   1    2      3
  2      4   5    6      7
b 1      8   9   10     11
  2     12  13   14     15

In [13]:
a.sort_index(0)# sort by index

    nagpur     pune mumbai
      cold hot  hot   cold
a 1      0   1    2      3
  2      4   5    6      7
b 1      8   9   10     11
  2     12  13   14     15

In [14]:
a.sort_index(1)# sort by city

    mumbai nagpur     pune
      cold   cold hot  hot
a 1      3      0   1    2
  2      7      4   5    6
b 1     11      8   9   10
  2     15     12  13   14

In [15]:
a.swaplevel(0)

    nagpur     pune mumbai
      cold hot  hot   cold
1 a      0   1    2      3
2 a      4   5    6      7
1 b      8   9   10     11
2 b     12  13   14     15

In [16]:
a.swaplevel(1)

    nagpur     pune mumbai
      cold hot  hot   cold
a 1      0   1    2      3
  2      4   5    6      7
b 1      8   9   10     11
  2     12  13   14     15

In [19]:
a.swaplevel('City','Temp',axis=1)

KeyError: 'Level City not found'

# Merging

In [24]:
df10=DataFrame({'DS1':[0,1,2,3,4],'KEY':['X','Z','Y','X','X']})
df10

   DS1 KEY
0    0   X
1    1   Z
2    2   Y
3    3   X
4    4   X

In [29]:
df11=DataFrame({'DS2':[1,2,3],'KEY':['Q','Y','Z']})
df11

   DS2 KEY
0    1   Q
1    2   Y
2    3   Z

In [41]:
df11=DataFrame({'DS1':np.arange(5).reshape([5,2]),'KEY':['xzyxx']})

ValueError: cannot reshape array of size 5 into shape (5,2)

In [35]:
pd.merge(df10,df11)# common values of both will print

   DS1 KEY  DS2
0    1   Z    3
1    2   Y    2

In [37]:
pd.merge(df10,df11,on='KEY')

   DS1 KEY  DS2
0    1   Z    3
1    2   Y    2

In [38]:
pd.merge(df10,df11,on='KEY',how='left')

   DS1 KEY  DS2
0    0   X  NaN
1    1   Z  3.0
2    2   Y  2.0
3    3   X  NaN
4    4   X  NaN

In [39]:
pd.merge(df10,df11,on='KEY',how='right')

   DS1 KEY  DS2
0  1.0   Z    3
1  2.0   Y    2
2  NaN   Q    1

In [40]:
pd.merge(df10,df11,on='KEY',how='outer')# both taking

   DS1 KEY  DS2
0  0.0   X  NaN
1  3.0   X  NaN
2  4.0   X  NaN
3  1.0   Z  3.0
4  2.0   Y  2.0
5  NaN   Q  1.0

In [69]:
df12=DataFrame({'DS3':np.arange(6),'KEY':list('xxyyzz')})
df12

   DS3 KEY
0    0   x
1    1   x
2    2   y
3    3   y
4    4   z
5    5   z

In [70]:
df13=DataFrame({'DS4':np.arange(5),'KEY':list('yyxxz')})
df13

   DS4 KEY
0    0   y
1    1   y
2    2   x
3    3   x
4    4   z

In [71]:
pd.merge(df12,df13)

   DS3 KEY  DS4
0    0   x    2
1    0   x    3
2    1   x    2
3    1   x    3
4    2   y    0
5    2   y    1
6    3   y    0
7    3   y    1
8    4   z    4
9    5   z    4

In [75]:
df14=DataFrame({'key1':('sf','sf','la'),'key2':('one','two','three'),'ld':(10,20,30)})
df14

  key1   key2  ld
0   sf    one  10
1   sf    two  20
2   la  three  30

In [77]:
df15=DataFrame({'key1':('sf','sf','la','la'),'key2':('one','one','one','two'),'ld':(40,50,60,70)})
df15

  key1 key2  ld
0   sf  one  40
1   sf  one  50
2   la  one  60
3   la  two  70

In [78]:
pd.merge(df14,df15,on=['key1','key2'],how='outer')

  key1   key2  ld_x  ld_y
0   sf    one  10.0  40.0
1   sf    one  10.0  50.0
2   sf    two  20.0   NaN
3   la  three  30.0   NaN
4   la    one   NaN  60.0
5   la    two   NaN  70.0

In [80]:
df16=DataFrame({'DATA':np.arange(5),'KEY':list('xyzxy')})
df16

   DATA KEY
0     0   x
1     1   y
2     2   z
3     3   x
4     4   y

In [111]:
df17=DataFrame({'data':[10,20]},index=['x','y'])
df17

   data
x    10
y    20

In [112]:
pd.merge(df16,df17,left_on='KEY',right_index=True)

   DATA KEY  data
0     0   x    10
3     3   x    10
1     1   y    20
4     4   y    20

In [113]:
pd.merge(df16,df17,left_on='KEY',right_index=True,how='outer')

   DATA KEY  data
0     0   x  10.0
3     3   x  10.0
1     1   y  20.0
4     4   y  20.0
2     2   z   NaN

# Concatenate

In [117]:
a=np.arange(0,9).reshape([3,3])
a

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [119]:
np.concatenate([a,a])# double write

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8],
       [0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [120]:
np.concatenate([a,a],axis=1)

array([[0, 1, 2, 0, 1, 2],
       [3, 4, 5, 3, 4, 5],
       [6, 7, 8, 6, 7, 8]])

In [123]:
b=Series((0,1,2),['T','U','V'])
b

T    0
U    1
V    2
dtype: int64

In [124]:
c=Series((3,4),['X','Y'])
c

X    3
Y    4
dtype: int64

In [127]:
pd.concat([b,c])# both taking

T    0
U    1
V    2
X    3
Y    4
dtype: int64

In [128]:
pd.concat([b,c],axis=1)

C:\Users\Shubham\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1
T  0.0  NaN
U  1.0  NaN
V  2.0  NaN
X  NaN  3.0
Y  NaN  4.0

In [48]:
ser1=Series((2,np.nan,4,np.nan,6,np.nan),['Q','R','S','T','U','V'])
ser1

Q    2.0
R    NaN
S    4.0
T    NaN
U    6.0
V    NaN
dtype: float64

In [49]:
ser2=Series((1,2,3,4,np.nan,np.nan),['Q','R','S','T','U','V'])
ser2

Q    1.0
R    2.0
S    3.0
T    4.0
U    NaN
V    NaN
dtype: float64

In [50]:
ser3=Series(np.where(ser1.notnull(),ser1,ser2),index=list('QRSTUV'))# not contain null values
ser3

Q    2.0
R    2.0
S    4.0
T    4.0
U    6.0
V    NaN
dtype: float64

In [136]:
ser1.combine_first(ser2)#ser2 combine in ser1    AND above statemant were SAME

Q    2.0
R    2.0
S    4.0
T    4.0
U    6.0
V    NaN
dtype: float64

In [141]:
df1=DataFrame([[1,np.nan,np.nan],[np.nan,5,9],[3,np.nan,np.nan],[np.nan,7,11]],columns=('x','y','z'))
df1

     x    y     z
0  1.0  NaN   NaN
1  NaN  5.0   9.0
2  3.0  NaN   NaN
3  NaN  7.0  11.0

In [145]:
df2=DataFrame([[2,np.nan],[4,10],[np.nan,12],[6,4],[8,16]],columns=('x','z'))
df2

     x     z
0  2.0   NaN
1  4.0  10.0
2  NaN  12.0
3  6.0   4.0
4  8.0  16.0

In [146]:
df1.combine_first(df2)

     x    y     z
0  1.0  NaN   NaN
1  4.0  5.0   9.0
2  3.0  NaN  12.0
3  6.0  7.0  11.0
4  8.0  NaN  16.0

# pivoting

In [12]:
df=DataFrame({'data':[1,2,3,1,2,3,1,2,3,1,2,3],'values':np.random.randn(12),'variable':list('aaabbbcccddd')})
df

    data    values variable
0      1 -0.264786        a
1      2 -0.738671        a
2      3 -1.359035        a
3      1  0.253654        b
4      2 -0.785926        b
5      3 -0.104585        b
6      1  0.036758        c
7      2 -0.791394        c
8      3 -1.107585        c
9      1  1.066057        d
10     2  0.199178        d
11     3 -1.675616        d

In [23]:
df_drop=DataFrame({'key1':list('aabbb'),'key2':[2,2,2,3,3]})
df_drop

  key1  key2
0    a     2
1    a     2
2    b     2
3    b     3
4    b     3

In [24]:
df_piv=df.pivot('data','variable','values')
df_piv

variable         a         b         c         d
data
1        -0.264786  0.253654  0.036758  1.066057
2        -0.738671 -0.785926 -0.791394  0.199178
3        -1.359035 -0.104585 -1.107585 -1.675616

In [25]:
df_drop.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [27]:
df_drop.drop_duplicates()

  key1  key2
0    a     2
2    b     2
3    b     3

In [33]:
df_drop.duplicated(['key1'],keep='last')# duplication start with last

0     True
1    False
2     True
3     True
4    False
dtype: bool

In [34]:
df_drop.drop_duplicates(['key1'],take_last_True)

NameError: name 'take_last_True' is not defined

# MAPPING

In [28]:
df_wt=DataFrame({'name':('komal','shamal','gaurav'),'weight':[120,90,70]})
df_wt

     name  weight
0   komal     120
1  shamal      90
2  gaurav      70

In [31]:
height_map={'komal':7,'shamal':6,'gaurav':5}# create a dictionary for mapping with dataframe  AND Join height
height_map

{'komal': 7, 'shamal': 6, 'gaurav': 5}

In [32]:
df_wt['height']=df_wt['name'].map(height_map)# mapping dictionary with dataframe 
df_wt['height']

0    7
1    6
2    5
Name: height, dtype: int64

In [56]:
df_wt

     name  weight  height
0   komal     120       7
1  shamal      90       6
2  gaurav      70       5

# Replace

In [58]:
ser1=Series([1,2,3,4,1,2,3,4],[0,1,2,4,5,6,7,8])
ser1

0    1
1    2
2    3
4    4
5    1
6    2
7    3
8    4
dtype: int64

In [59]:
ser1.replace(1,np.nan)# 1= null

0    NaN
1    2.0
2    3.0
4    4.0
5    NaN
6    2.0
7    3.0
8    4.0
dtype: float64

In [60]:
ser1.replace([1,4],[100,400])

0    100
1      2
2      3
4    400
5    100
6      2
7      3
8    400
dtype: int64

In [70]:
df_r=DataFrame(np.arange(0,12).reshape([3,4]),index=('NY','LA','SF'))
df_r

    0  1   2   3
NY  0  1   2   3
LA  4  5   6   7
SF  8  9  10  11

In [72]:
df_r.index.map(str.lower)#  lower case

Index(['ny', 'la', 'sf'], dtype='object')

In [73]:
df_r=df_r.index.map(str.lower)# store
df_r

Index(['ny', 'la', 'sf'], dtype='object')

In [78]:
df_r.rename(index=str.title,columns=str.lower)

TypeError: rename() got an unexpected keyword argument 'index'

In [80]:
df_r.rename(index={'NY':'NEW YORK'},columns={'a':'Alpha'},inplace=True)

TypeError: rename() got an unexpected keyword argument 'index'

# Binning Function

In [16]:
import numpy as np
import pandas as pd
from pandas import Series , DataFrame
%matplotlib inline
import matplotlib.pyplot as plt

In [17]:
years=[1990,1991,1992,2008,2012,2015,1987,1967,2013,2008,1999]
years

[1990, 1991, 1992, 2008, 2012, 2015, 1987, 1967, 2013, 2008, 1999]

In [18]:
len(years)

11

In [19]:
decayed_bins=[1960,1970,1980,1990,2000,2010,2020]
decayed_bins

[1960, 1970, 1980, 1990, 2000, 2010, 2020]

In [20]:
decayed_category=pd.cut(years,decayed_bins)
decayed_category

[(1980, 1990], (1990, 2000], (1990, 2000], (2000, 2010], (2010, 2020], ..., (1980, 1990], (1960, 1970], (2010, 2020], (2000, 2010], (1990, 2000]]
Length: 11
Categories (6, interval[int64]): [(1960, 1970] < (1970, 1980] < (1980, 1990] < (1990, 2000] < (2000, 2010] < (2010, 2020]]

In [21]:
decayed_category.categories

IntervalIndex([(1960, 1970], (1970, 1980], (1980, 1990], (1990, 2000], (2000, 2010], (2010, 2020]]
              closed='right',
              dtype='interval[int64]')

In [23]:
pd.value_counts(decayed_category)

(2010, 2020]    3
(1990, 2000]    3
(2000, 2010]    2
(1980, 1990]    2
(1960, 1970]    1
(1970, 1980]    0
dtype: int64

In [24]:
pd.cut(years,2,precision=1)

[(1967.0, 1991.0], (1967.0, 1991.0], (1991.0, 2015.0], (1991.0, 2015.0], (1991.0, 2015.0], ..., (1967.0, 1991.0], (1967.0, 1991.0], (1991.0, 2015.0], (1991.0, 2015.0], (1991.0, 2015.0]]
Length: 11
Categories (2, interval[float64]): [(1967.0, 1991.0] < (1991.0, 2015.0]]

In [25]:
pd.cut(years,2)

[(1966.952, 1991.0], (1966.952, 1991.0], (1991.0, 2015.0], (1991.0, 2015.0], (1991.0, 2015.0], ..., (1966.952, 1991.0], (1966.952, 1991.0], (1991.0, 2015.0], (1991.0, 2015.0], (1991.0, 2015.0]]
Length: 11
Categories (2, interval[float64]): [(1966.952, 1991.0] < (1991.0, 2015.0]]

# outliars

In [28]:
a=DataFrame(np.random.randn(1000,4))
a

            0         1         2         3
0    0.243154 -2.944763 -0.046575  2.400900
1   -1.426441  0.974813  3.216193  0.453124
2    1.209735 -0.590515  1.236643 -0.242384
3   -0.167989  0.141083  0.206510  1.335220
4   -1.277854  1.012077  0.338895 -0.037108
5   -1.482329 -1.549789 -0.239075  0.151060
6    0.946314 -0.129285 -2.163159  0.629051
7    0.347324  1.002883  0.871367 -2.190991
8    0.178258  0.701243 -1.014372  0.467693
9    2.100685 -0.696602  1.418983 -0.418303
10  -0.763629  0.109724  0.227559  0.874992
11  -0.536800  0.997463  1.208578 -0.472423
12  -0.058977  0.396881 -0.600473 -1.514188
13   0.709520  0.385947  0.125096  2.408649
14   1.586263  2.233571  1.409578 -0.473568
15   0.526130 -1.368279  0.731132  2.138138
16  -1.210871  0.192923  0.544695 -0.786525
17   1.120499 -0.032307  0.450073  0.402217
18  -0.042818  1.469212  0.738206 -1.088333
19  -1.061035  1.319587  2.190315  0.747127
20  -1.689064 -0.079467 -0.287587  1.613404
21   1.198594 -0.753591  1.118879  1.663019
22  -0.719300  0.919478  1.236416  0.109661
23  -0.113800  0.661791 -1.547878 -0.079789
24  -0.397443 -0.460139  1.582622  0.710711
25   0.438344 -0.592015  1.548099 -0.105497
26  -0.861618  0.261603 -0.732528  1.293636
27   0.843029 -1.832728 -1.244707 -1.248135
28   1.100075  1.239405 -0.452173 -0.249296
29  -0.983259 -0.259511 -0.295539  1.804042
..        ...       ...       ...       ...
970 -0.400450  0.385440 -0.055774 -0.041932
971 -0.420824  0.460833  0.527456  1.432383
972  0.404483 -1.602302 -0.003463 -1.354410
973  0.276509 -0.080699  1.494828  0.017293
974 -0.471250  0.331236 -0.675317  0.833560
975 -1.790724  0.097682 -1.252804 -0.732145
976  2.206722 -0.421148 -1.532810  2.855021
977 -1.740017  2.548041 -0.916488 -0.525471
978  1.266234 -0.161518  1.486473  1.727169
979 -0.659840 -0.305894 -0.476242  0.009295
980 -0.016933  0.283262 -1.930653 -0.470932
981  0.584262 -1.242728  1.602060 -1.056133
982 -1.968567  0.038800 -0.860409 -0.263519
983 -0.139617  0.565215  0.231161  1.933805
984 -0.674418 -1.088497 -0.507481 -0.802004
985 -0.300669 -0.476677 -0.442445 -0.233092
986  0.851295 -0.452561  0.711706 -1.465461
987  1.043594  2.663693  0.609977  1.247885
988 -0.757732 -0.566318  2.007382  1.001791
989 -1.801526  0.451885 -1.453178  0.036836
990  0.363679  0.047447  1.154332  0.687751
991 -1.175875  1.349293 -0.919672 -1.990696
992 -0.200718 -0.965730  1.467914  0.265603
993 -0.556657 -1.117624  0.356575  1.065972
994 -0.344533  0.943156  0.284325  1.281970
995 -1.305412  0.621290 -0.438362  1.295565
996  1.012826  0.833663  2.632330 -1.082630
997  1.646905 -2.296853  0.031381  0.657358
998  0.558819 -0.933831  0.068606 -0.266168
999 -0.613162  0.266565 -0.714825 -0.064925

[1000 rows x 4 columns]

In [29]:
a.head()

          0         1         2         3
0  0.243154 -2.944763 -0.046575  2.400900
1 -1.426441  0.974813  3.216193  0.453124
2  1.209735 -0.590515  1.236643 -0.242384
3 -0.167989  0.141083  0.206510  1.335220
4 -1.277854  1.012077  0.338895 -0.037108

In [30]:
a.tail()

            0         1         2         3
995 -1.305412  0.621290 -0.438362  1.295565
996  1.012826  0.833663  2.632330 -1.082630
997  1.646905 -2.296853  0.031381  0.657358
998  0.558819 -0.933831  0.068606 -0.266168
999 -0.613162  0.266565 -0.714825 -0.064925

In [31]:
a.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.059767     0.055797     0.040330    -0.005596
std       1.033150     0.985220     0.991300     0.988109
min      -3.205962    -3.538504    -3.212098    -3.368931
25%      -0.625560    -0.592048    -0.579647    -0.658773
50%       0.048925     0.026711     0.018744    -0.031981
75%       0.752975     0.714549     0.635208     0.654181
max       4.378309     3.221752     3.719388     3.434618

In [34]:
first_columns=a[0]
first_columns

0      0.243154
1     -1.426441
2      1.209735
3     -0.167989
4     -1.277854
5     -1.482329
6      0.946314
7      0.347324
8      0.178258
9      2.100685
10    -0.763629
11    -0.536800
12    -0.058977
13     0.709520
14     1.586263
15     0.526130
16    -1.210871
17     1.120499
18    -0.042818
19    -1.061035
20    -1.689064
21     1.198594
22    -0.719300
23    -0.113800
24    -0.397443
25     0.438344
26    -0.861618
27     0.843029
28     1.100075
29    -0.983259
         ...
970   -0.400450
971   -0.420824
972    0.404483
973    0.276509
974   -0.471250
975   -1.790724
976    2.206722
977   -1.740017
978    1.266234
979   -0.659840
980   -0.016933
981    0.584262
982   -1.968567
983   -0.139617
984   -0.674418
985   -0.300669
986    0.851295
987    1.043594
988   -0.757732
989   -1.801526
990    0.363679
991   -1.175875
992   -0.200718
993   -0.556657
994   -0.344533
995   -1.305412
996    1.012826
997    1.646905
998    0.558819
999   -0.613162
Name: 0, Length: 1000, dtype: float64

In [35]:
pd.value_counts(first_columns>3)# true =2  bz all value should be less 3(see descrebe = max (more than 3)  )

False    998
True       2
Name: 0, dtype: int64

In [36]:
first_columns[first_columns>3]# show index number, And value which is greter than 3

447    4.378309
765    4.041159
Name: 0, dtype: float64

# Group By

In [37]:
# GB on the basis of 2 columns
# type 1

In [44]:
df=DataFrame({'key1':('x','x','y','z','z'),'key2':('alpha','beta','alpha','beta','alpha'),'d1':np.random.randn(5),'d2':np.random.randn(5)})
df

  key1   key2        d1        d2
0    x  alpha -0.201084  1.237566
1    x   beta  0.154503 -0.451316
2    y  alpha -2.069456  1.838706
3    z   beta  0.185769  1.819129
4    z  alpha -0.478102 -0.561937

In [46]:
df=DataFrame({'key1':list('xxyzz'),'key2':('alpha','beta','alpha','beta','alpha'),'d1':np.random.randn(5),'d2':np.random.randn(5)})
df

  key1   key2        d1        d2
0    x  alpha  0.615725  1.546763
1    x   beta -1.185995  1.566720
2    y  alpha -0.302994  1.162520
3    z   beta  0.990053 -1.434774
4    z  alpha -0.257120  0.468319

In [50]:
group1=df['d1'].groupby(df['key2'])# store
group1

In [67]:
group1=df['d1'].groupby(df['key2']).count()# store
group1

key2
alpha    3
beta     2
Name: d1, dtype: int64

In [51]:
group1.mean()# mean of alpha nd beta

key2
alpha    0.018537
beta    -0.097971
Name: d1, dtype: float64

In [57]:
group1.count()

key2
alpha    3
beta     2
Name: d1, dtype: int64

In [58]:
group1.sum()

key2
alpha    0.055611
beta    -0.195943
Name: d1, dtype: float64

In [59]:
#type 2 on the basis of columns and array

In [60]:
cities=['LA','LA','NY','NY','NY']

In [63]:
months=np.array(['jan','feb','jan','feb','jan'])

In [65]:
df['d2'].groupby([cities,months]).count# d2 taken from data frame

LA  feb    1
    jan    1
NY  feb    1
    jan    2
Name: d2, dtype: int64

In [68]:
# type3 = on the basis on 1 columns

In [69]:
df.groupby(['key1']).mean()# take d1 ,d2 mean

            d1        d2
key1
x    -0.285135  1.556741
y    -0.302994  1.162520
z     0.366466 -0.483227

In [70]:
df.groupby(['key1','key2']).mean()#  take key1 ,key2,d1,d2 = individual value, not similer in x,y,z

                  d1        d2
key1 key2
x    alpha  0.615725  1.546763
     beta  -1.185995  1.566720
y    alpha -0.302994  1.162520
z    alpha -0.257120  0.468319
     beta   0.990053 -1.434774

In [71]:
#type 4= on the bassis of dictionary and data frame

In [84]:
df=DataFrame(np.arange(16).reshape([4,4]),index=['cat','dog','cow','tiger'],columns=list('xyzw'))
df

        x   y   z   w
cat     0   1   2   3
dog     4   5   6   7
cow     8   9  10  11
tiger  12  13  14  15

In [93]:
df.loc['dog',['w','y']]=np.nan
df

        x     y   z     w
cat     0   1.0   2   3.0
dog     4   NaN   6   NaN
cow     8   9.0  10  11.0
tiger  12  13.0  14  15.0

In [94]:
behaviour_map={'w':'good','x':'bad','y':'good','z':'bad'}# take bad + x,z = _values____
behaviour_map

{'w': 'good', 'x': 'bad', 'y': 'good', 'z': 'bad'}

In [95]:
df.groupby(behaviour_map,axis=1).count()# how many times= count

       bad  good
cat      2     2
dog      2     0
cow      2     2
tiger    2     2

In [96]:
df.groupby(behaviour_map,axis=1).sum()

        bad  good
cat     2.0   4.0
dog    10.0   0.0
cow    18.0  20.0
tiger  26.0  28.0

In [97]:
#Type5= on the basis of series

In [99]:
beh_Ser=Series(behaviour_map)
beh_Ser

w    good
x     bad
y    good
z     bad
dtype: object

In [100]:
df.groupby(beh_Ser,axis=1).count()

       bad  good
cat      2     2
dog      2     0
cow      2     2
tiger    2     2

In [101]:
df.groupby(len).count()

   x  y  z  w
3  3  2  3  2
5  1  1  1  1

In [103]:
df.groupby(len).max()# index of (cat cow).... index length is 3,3,3,5 bz we are not assign columns

    x     y   z     w
3   8   9.0  10  11.0
5  12  13.0  14  15.0

In [105]:
world_cup={'Team':['West Indies','West Indies','India','Australia','Pakistan','Sri Lanka','Australia','Australia','Australia','India','Australia'],'Rank':[7,1,2,5,6,4,1,1,1,2,1],'Year':[1975,1979,1983,1987,1992,1996,1999,2003,2007,2011,2015]}   
df=pd.DataFrame(world_cup)
df.to_csv("forsparkProcessing.csv",index=False)

In [84]:
for x,y in df[["Team","Rank"]].groupby(["Team"]):
    print(x)

Australia
India
Pakistan
Sri Lanka
West Indies

In [97]:
df[["Team","Rank"]].groupby(["Team"]).sum()

             Rank
Team
Australia       9
India           4
Pakistan        6
Sri Lanka       4
West Indies     8

In [89]:
grouped=df[["Team","Rank"]].groupby(["Team"])
grouped.get_group('India')

    Team  Rank
2  India     2
9  India     2

In [106]:
# Grouping two column and getting sum of the one of them

df[["Team","Rank"]].groupby(["Team","Rank"]).agg({'Rank':'count'})

# Equivalent sql query
# spark.sql("select Team, Rank, sum(Rank) from dft group by Team, Rank order by Team, Rank ASC").show()

# Equivalent spark query
# df.select("Team","Rank").groupBy("Team","Rank").agg(sum("Rank")).sort("Team").show()

                  Rank
Team        Rank
Australia   1        4
            5        1
India       2        2
Pakistan    6        1
Sri Lanka   4        1
West Indies 1        1
            7        1

# Iteriteams, iterrows, itertuples

In [26]:
champion_stats={'Team':['India','Australia','West Indies','Pakistan','Sri Lanka'],
                'ICC_rank':[2,3,7,8,4],
               'World_champions_Year':[2011,2015,1979,1992,1996],
               'Points':[874,787,753,673,855]}

match_stats={'Team':['Australia','India','West Indies','Pakistan','Sri Lanka'],
            'World_cup_played':[11,10,11,9,8],
            'ODis_played':[733,988,712,679,662]}

df1=pd.DataFrame(champion_stats)
df2=pd.DataFrame(match_stats)
df1

          Team  ICC_rank  World_champions_Year  Points
0        India         2                  2011     874
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [28]:
df1['Team']
df1[1:]

          Team  ICC_rank  World_champions_Year  Points
1    Australia         3                  2015     787
2  West Indies         7                  1979     753
3     Pakistan         8                  1992     673
4    Sri Lanka         4                  1996     855

In [91]:
# Iterate over dataframe taking one column in the account
for key, value in df1.iteritems():
    print(key)
    print()
    print(value)
    print()

Team

0          India
1      Australia
2    West Indies
3       Pakistan
4      Sri Lanka
Name: Team, dtype: object

ICC_rank

0    2
1    3
2    7
3    8
4    4
Name: ICC_rank, dtype: int64

World_champions_Year

0    2011
1    2015
2    1979
3    1992
4    1996
Name: World_champions_Year, dtype: int64

Points

0    874
1    787
2    753
3    673
4    855
Name: Points, dtype: int64

In [92]:
# Iterate over dataframe taking one row in the account
for key, value in df1.iterrows():
    print(key)
    print()
    print(value)
    print()

0

Team                    India
ICC_rank                    2
World_champions_Year     2011
Points                    874
Name: 0, dtype: object

1

Team                    Australia
ICC_rank                        3
World_champions_Year         2015
Points                        787
Name: 1, dtype: object

2

Team                    West Indies
ICC_rank                          7
World_champions_Year           1979
Points                          753
Name: 2, dtype: object

3

Team                    Pakistan
ICC_rank                       8
World_champions_Year        1992
Points                       673
Name: 3, dtype: object

4

Team                    Sri Lanka
ICC_rank                        4
World_champions_Year         1996
Points                        855
Name: 4, dtype: object

In [93]:
# Iterate over dataframe taking one row as TUPLE in the account
for row in df1.itertuples():
    print(row)
    print()

Pandas(Index=0, Team='India', ICC_rank=2, World_champions_Year=2011, Points=874)

Pandas(Index=1, Team='Australia', ICC_rank=3, World_champions_Year=2015, Points=787)

Pandas(Index=2, Team='West Indies', ICC_rank=7, World_champions_Year=1979, Points=753)

Pandas(Index=3, Team='Pakistan', ICC_rank=8, World_champions_Year=1992, Points=673)

Pandas(Index=4, Team='Sri Lanka', ICC_rank=4, World_champions_Year=1996, Points=855)

In [33]:
import seaborn as sns

In [34]:
tips=sns.load_dataset('tips')
tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [40]:
tips.groupby(['sex','smoker']).agg({'tip':'sum','total_bill':'sum','smoker':'count'})
# tips.groupby(['sex','smoker'])[['tip','total_bill']].sum()

                  tip  total_bill  smoker
sex    smoker
Male   Yes     183.07     1337.07      60
       No      302.00     1919.75      97
Female Yes      96.74      593.27      33
       No      149.77      977.68      54

In [55]:

# Import pandas package 
import pandas as pd 
    
# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'], 
        'Age':[27, 24, 22, 32, 15], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] } 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data) 
  
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd
4   Geeku   15      Noida          10th

In [42]:

# Import pandas package 
import pandas as pd 
    
# Define a dictionary containing employee data 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj', 'Geeku'], 
        'Age':[27, 24, 22, 32, 15], 
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj', 'Noida'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd', '10th'] } 
  
index = {'a', 'b', 'c', 'd', 'e'} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data, index) 
  
# Make Own Index as index 
# In this case default index is exist  
df.reset_index(inplace = True) 
  
df

  index    Name  Age    Address Qualification
0     d     Jai   27      Delhi           Msc
1     a  Princi   24     Kanpur            MA
2     b  Gaurav   22  Allahabad           MCA
3     c    Anuj   32    Kannauj           Phd
4     e   Geeku   15      Noida          10th

In [56]:
df0=df.sort_values("Name")
df0

     Name  Age    Address Qualification
3    Anuj   32    Kannauj           Phd
2  Gaurav   22  Allahabad           MCA
4   Geeku   15      Noida          10th
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA

In [58]:
df0.reset_index()

   index    Name  Age    Address Qualification
0      3    Anuj   32    Kannauj           Phd
1      2  Gaurav   22  Allahabad           MCA
2      4   Geeku   15      Noida          10th
3      0     Jai   27      Delhi           Msc
4      1  Princi   24     Kanpur            MA

In [88]:
data={ "tv_shows":['tarak','ahat','cid','shaktiman','kumkum','himym'],'time':[11,11.5,12,12.5,1,1.5]}

dfshow=pd.DataFrame(data)
po=dfshow['time']
po.pop(0)
newdt=list(po)
# newdtseries=pd.Series(newdt)
# dfshow["newdt"]=newdtseries
dfshow

    tv_shows  time
0      tarak  11.0
1       ahat  11.5
2        cid  12.0
3  shaktiman  12.5
4     kumkum   1.0
5      himym   1.5

In [95]:
newdtseries=pd.DataFrame(newdt)
pd.concat([dfshow,newdtseries],axis=1)

    tv_shows  time     0
0      tarak  11.0  11.5
1       ahat  11.5  12.0
2        cid  12.0  12.5
3  shaktiman  12.5   1.0
4     kumkum   1.0   1.5
5      himym   1.5   NaN

In [2]:
import pandas as pd
data={ "tv_shows":['tarak','ahat','cid','shaktiman','kumkum','himym'],'time':[11,11.5,12,12.5,1,1.5]}

dfshow=pd.DataFrame(data)

0    11.0
1    11.5
2    12.0
3    12.5
4     1.0
5     1.5
Name: time, dtype: float64

In [ ]:
def ArrayChallenge(arr):
  sts=set(arr)
  lst=[]
  for x in sts:
    lst.append(arr.count(x)-1)
  # code goes here

  return sum(lst)

# keep this function call here 
print ArrayChallenge(raw_input())

In [19]:
1%10

1

In [20]:
(126).toDate

AttributeError: 'int' object has no attribute 'toDate'